In [284]:
# !pip install pandas

In [285]:
# !pip install faker

In [286]:
import pandas as pd
import numpy as np
import random
# import faker

In [287]:
dict_ = {
    'name': ['Ali', 'Khan', 'Omer', 'Dark'],
    'marks': [93, 21, 35, 90],
    'city': ['Karachi', 'Lahore', 'Islamabad', 'Peshawar']
}

In [288]:
dict_

{'name': ['Ali', 'Khan', 'Omer', 'Dark'],
 'marks': [93, 21, 35, 90],
 'city': ['Karachi', 'Lahore', 'Islamabad', 'Peshawar']}

In [289]:
df = pd.DataFrame(dict_)

In [290]:
df

   name  marks       city
0   Ali     93    Karachi
1  Khan     21     Lahore
2  Omer     35  Islamabad
3  Dark     90   Peshawar

In [291]:
df.name

0     Ali
1    Khan
2    Omer
3    Dark
Name: name, dtype: object

In [292]:

df.to_csv('students.csv') # if you not print the index of dataFrame then use the index=False

In [293]:
df.head(2)

   name  marks     city
0   Ali     93  Karachi
1  Khan     21   Lahore

In [294]:
df.tail(2)

   name  marks       city
2  Omer     35  Islamabad
3  Dark     90   Peshawar

In [295]:
df.describe()

          marks
count   4.00000
mean   59.75000
std    37.12479
min    21.00000
25%    31.50000
50%    62.50000
75%    90.75000
max    93.00000

In [296]:
df.index = ['First', 'Second', 'Third', 'Fourth']

In [297]:
df

        name  marks       city
First    Ali     93    Karachi
Second  Khan     21     Lahore
Third   Omer     35  Islamabad
Fourth  Dark     90   Peshawar

In [298]:
# Initialize Faker for generating fake data
# fake = faker.Faker()

In [299]:
# # List of majors and cities for more realistic data
# majors = ['Computer Science', 'Biology', 'Engineering', 'Business', 'Mathematics', 'Physics', 'Chemistry',
#            'History', 'English', 'Economics', 'Psychology', 'Sociology', 'Political Science', 'Art', 'Music']
# cities = ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Philadelphia', 'Phoenix', 'San Antonio',
#            'San Diego', 'Dallas', 'San Jose', 'Austin', 'Jacksonville', 'Fort Worth', 'Columbus', 'Charlotte']

In [300]:
# # Generate data
# data = []
# for i in range(1, 101):
#     student = {
#         "id": i,
#         "name": fake.name(),
#         "major": random.choice(majors),
#         "GPA": round(random.uniform(2.0, 4.0), 2),
#         "city": random.choice(cities),
#         "age": random.randint(18, 25),
#         "email": fake.email(),
#         "graduation_year": random.randint(2023, 2027)
#     }
#     data.append(student)

# # Create DataFrame
# df = pd.DataFrame(data)

In [301]:
# # Save to CSV
# file_path = 'students3.csv'
# df.to_csv(file_path, index=False)

# file_path

In [302]:

dff = pd.read_csv('Dark.csv')

In [303]:
dff

,id,name,major,GPA,city,age,email,graduation_year
0,1,Dark,Business,2.56,Jacksonville,19,dark@gmail.com,2024
1,2,Jonathan Johnston,Business,3.21,San Diego,20,rmurphy@gmail.com,2025
2,3,Natalie Bentley,Engineering,3.65,San Jose,25,robinsonrita@diaz-miranda.com,2026
3,4,Anita Mills,Chemistry,2.36,Philadelphia,24,qhardy@hotmail.com,2025
4,5,Danielle Cummings,Psychology,2.23,San Diego,19,deleonadam@young-stephenson.com,2024
...,...,...,...,...,...,...,...,...
95,96,Christina Quinn,Biology,2.55,Columbus,24,lewiskelly@dawson.com,2023
96,97,Chad Fernandez,Art,2.95,Phoenix,20,kimberlyjohnson@leonard-munoz.com,2026
97,98,Scott Smith,Art,2.91,New York,21,savagekayla@johnson.com,2025
98,99,Stephanie Carrillo,Biology,3.28,San Diego,19,smithmichelle@ramos.com,2023
99,100,Jeffrey Farrell,Engineering,3.43,Houston,24,megan43@yahoo.com,2026

In [304]:
Dark = pd.DataFrame(dff)

In [305]:
Dark

,id,name,major,GPA,city,age,email,graduation_year
0,1,Dark,Business,2.56,Jacksonville,19,dark@gmail.com,2024
1,2,Jonathan Johnston,Business,3.21,San Diego,20,rmurphy@gmail.com,2025
2,3,Natalie Bentley,Engineering,3.65,San Jose,25,robinsonrita@diaz-miranda.com,2026
3,4,Anita Mills,Chemistry,2.36,Philadelphia,24,qhardy@hotmail.com,2025
4,5,Danielle Cummings,Psychology,2.23,San Diego,19,deleonadam@young-stephenson.com,2024
...,...,...,...,...,...,...,...,...
95,96,Christina Quinn,Biology,2.55,Columbus,24,lewiskelly@dawson.com,2023
96,97,Chad Fernandez,Art,2.95,Phoenix,20,kimberlyjohnson@leonard-munoz.com,2026
97,98,Scott Smith,Art,2.91,New York,21,savagekayla@johnson.com,2025
98,99,Stephanie Carrillo,Biology,3.28,San Diego,19,smithmichelle@ramos.com,2023
99,100,Jeffrey Farrell,Engineering,3.43,Houston,24,megan43@yahoo.com,2026

In [306]:
Dark['age'][0] = 19

C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\2673981177.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  Dark['age'][0] = 19
C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\2673981177.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Dark['age'][0] = 19

In [307]:
Dark

,id,name,major,GPA,city,age,email,graduation_year
0,1,Dark,Business,2.56,Jacksonville,19,dark@gmail.com,2024
1,2,Jonathan Johnston,Business,3.21,San Diego,20,rmurphy@gmail.com,2025
2,3,Natalie Bentley,Engineering,3.65,San Jose,25,robinsonrita@diaz-miranda.com,2026
3,4,Anita Mills,Chemistry,2.36,Philadelphia,24,qhardy@hotmail.com,2025
4,5,Danielle Cummings,Psychology,2.23,San Diego,19,deleonadam@young-stephenson.com,2024
...,...,...,...,...,...,...,...,...
95,96,Christina Quinn,Biology,2.55,Columbus,24,lewiskelly@dawson.com,2023
96,97,Chad Fernandez,Art,2.95,Phoenix,20,kimberlyjohnson@leonard-munoz.com,2026
97,98,Scott Smith,Art,2.91,New York,21,savagekayla@johnson.com,2025
98,99,Stephanie Carrillo,Biology,3.28,San Diego,19,smithmichelle@ramos.com,2023
99,100,Jeffrey Farrell,Engineering,3.43,Houston,24,megan43@yahoo.com,2026

In [308]:
Dark['email'][0] = 'dark@gmail.com'
Dark['name'][0] = 'Dark'

C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\2668981450.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  Dark['email'][0] = 'dark@gmail.com'
C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\2668981450.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Dark['email'][0] = 'dark@gmail.com'
C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\2668981450.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  Dark['name'][0] = 'Dark'
C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\2668981450.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Dark['name'][0] = 'Dark'

In [309]:
Dark

,id,name,major,GPA,city,age,email,graduation_year
0,1,Dark,Business,2.56,Jacksonville,19,dark@gmail.com,2024
1,2,Jonathan Johnston,Business,3.21,San Diego,20,rmurphy@gmail.com,2025
2,3,Natalie Bentley,Engineering,3.65,San Jose,25,robinsonrita@diaz-miranda.com,2026
3,4,Anita Mills,Chemistry,2.36,Philadelphia,24,qhardy@hotmail.com,2025
4,5,Danielle Cummings,Psychology,2.23,San Diego,19,deleonadam@young-stephenson.com,2024
...,...,...,...,...,...,...,...,...
95,96,Christina Quinn,Biology,2.55,Columbus,24,lewiskelly@dawson.com,2023
96,97,Chad Fernandez,Art,2.95,Phoenix,20,kimberlyjohnson@leonard-munoz.com,2026
97,98,Scott Smith,Art,2.91,New York,21,savagekayla@johnson.com,2025
98,99,Stephanie Carrillo,Biology,3.28,San Diego,19,smithmichelle@ramos.com,2023
99,100,Jeffrey Farrell,Engineering,3.43,Houston,24,megan43@yahoo.com,2026

In [310]:
Dark.to_csv('Dark.csv', index=False)

In [311]:
ser_df = pd.Series(np.random.randint(1, 100, size=10))

In [312]:
ser_df

0    88
1    28
2     9
3    13
4    74
5    89
6    65
7    94
8    81
9    67
dtype: int32

In [313]:
type(ser_df)

pandas.core.series.Series

In [314]:
ran_df = pd.DataFrame(np.random.randint(1, 100, size=(5, 10)))

In [315]:
type(ran_df)

pandas.core.frame.DataFrame

In [316]:
ran_df

    0   1   2   3   4   5   6   7   8   9
0  29  44   4  20  83  84  23   3  34  45
1  25  59   6  80  85  41  74  15  81  71
2   5  29  23  51  74  47  74   1  64  26
3  28  22  95  26  44  79  62  17  35  31
4  30  15  86  27  82  40  94  11  87  20

In [317]:
ran_df.describe()

,0,1,2,3,4,5,6,7,8,9
count,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000
mean,23.400000,33.800000,42.800000,40.800000,73.600000,58.200000,65.400000,9.400000,60.200000,38.600000
std,10.454664,17.711578,44.279792,24.913852,17.067513,21.510463,26.340084,7.127412,24.933913,20.329781
min,5.000000,15.000000,4.000000,20.000000,44.000000,40.000000,23.000000,1.000000,34.000000,20.000000
25%,25.000000,22.000000,6.000000,26.000000,74.000000,41.000000,62.000000,3.000000,35.000000,26.000000
50%,28.000000,29.000000,23.000000,27.000000,82.000000,47.000000,74.000000,11.000000,64.000000,31.000000
75%,29.000000,44.000000,86.000000,51.000000,83.000000,79.000000,74.000000,15.000000,81.000000,45.000000
max,30.000000,59.000000,95.000000,80.000000,85.000000,84.000000,94.000000,17.000000,87.000000,71.000000

In [318]:
ran_df.dtypes

0    int32
1    int32
2    int32
3    int32
4    int32
5    int32
6    int32
7    int32
8    int32
9    int32
dtype: object

In [319]:
ran_df[0][0] = 'dark'

C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\2046308830.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  ran_df[0][0] = 'dark'
C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\2046308830.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'dark' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  ran_df[0][0] = 'dark'

In [320]:
ran_df

      0   1   2   3   4   5   6   7   8   9
0  dark  44   4  20  83  84  23   3  34  45
1    25  59   6  80  85  41  74  15  81  71
2     5  29  23  51  74  47  74   1  64  26
3    28  22  95  26  44  79  62  17  35  31
4    30  15  86  27  82  40  94  11  87  20

In [321]:
type(ran_df)

pandas.core.frame.DataFrame

In [322]:
ran_df.dtypes

0    object
1     int32
2     int32
3     int32
4     int32
5     int32
6     int32
7     int32
8     int32
9     int32
dtype: object

In [323]:
ran_df.index

RangeIndex(start=0, stop=5, step=1)

In [324]:
pd.Index(ran_df)

Index([('dark', 44, 4, 20, 83, 84, 23, 3, 34, 45),
          (25, 59, 6, 80, 85, 41, 74, 15, 81, 71),
           (5, 29, 23, 51, 74, 47, 74, 1, 64, 26),
         (28, 22, 95, 26, 44, 79, 62, 17, 35, 31),
         (30, 15, 86, 27, 82, 40, 94, 11, 87, 20)],
      dtype='object')

In [325]:
ran_df.columns

RangeIndex(start=0, stop=10, step=1)

In [326]:
ran_df.to_numpy()

array([['dark', 44, 4, 20, 83, 84, 23, 3, 34, 45],
       [25, 59, 6, 80, 85, 41, 74, 15, 81, 71],
       [5, 29, 23, 51, 74, 47, 74, 1, 64, 26],
       [28, 22, 95, 26, 44, 79, 62, 17, 35, 31],
       [30, 15, 86, 27, 82, 40, 94, 11, 87, 20]], dtype=object)

In [327]:
ran_df.T

      0   1   2   3   4
0  dark  25   5  28  30
1    44  59  29  22  15
2     4   6  23  95  86
3    20  80  51  26  27
4    83  85  74  44  82
5    84  41  47  79  40
6    23  74  74  62  94
7     3  15   1  17  11
8    34  81  64  35  87
9    45  71  26  31  20

In [328]:
ran_df[0][0] = 50

In [329]:
ran_df

    0   1   2   3   4   5   6   7   8   9
0  50  44   4  20  83  84  23   3  34  45
1  25  59   6  80  85  41  74  15  81  71
2   5  29  23  51  74  47  74   1  64  26
3  28  22  95  26  44  79  62  17  35  31
4  30  15  86  27  82  40  94  11  87  20

In [330]:
ran_df.sort_index(axis=0, ascending=False)

    0   1   2   3   4   5   6   7   8   9
4  30  15  86  27  82  40  94  11  87  20
3  28  22  95  26  44  79  62  17  35  31
2   5  29  23  51  74  47  74   1  64  26
1  25  59   6  80  85  41  74  15  81  71
0  50  44   4  20  83  84  23   3  34  45

In [331]:
ran_df.sort_index(axis=1, ascending=False)

    9   8   7   6   5   4   3   2   1   0
0  45  34   3  23  84  83  20   4  44  50
1  71  81  15  74  41  85  80   6  59  25
2  26  64   1  74  47  74  51  23  29   5
3  31  35  17  62  79  44  26  95  22  28
4  20  87  11  94  40  82  27  86  15  30

In [332]:
ran_df[0]

0    50
1    25
2     5
3    28
4    30
Name: 0, dtype: object

In [333]:
type(ran_df[0])

pandas.core.series.Series

In [334]:
new_ran_df = ran_df

In [335]:
new_ran_df[0][0] = 100

In [336]:
new_ran_df

     0   1   2   3   4   5   6   7   8   9
0  100  44   4  20  83  84  23   3  34  45
1   25  59   6  80  85  41  74  15  81  71
2    5  29  23  51  74  47  74   1  64  26
3   28  22  95  26  44  79  62  17  35  31
4   30  15  86  27  82  40  94  11  87  20

In [337]:
ran_df

     0   1   2   3   4   5   6   7   8   9
0  100  44   4  20  83  84  23   3  34  45
1   25  59   6  80  85  41  74  15  81  71
2    5  29  23  51  74  47  74   1  64  26
3   28  22  95  26  44  79  62  17  35  31
4   30  15  86  27  82  40  94  11  87  20

In [338]:
copy_ran_df = ran_df.copy()

In [339]:
copy_ran_df[0][0] = 500

C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\56683498.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  copy_ran_df[0][0] = 500
C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\56683498.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  copy_ran_df[0][0] = 500

In [340]:
copy_ran_df

     0   1   2   3   4   5   6   7   8   9
0  500  44   4  20  83  84  23   3  34  45
1   25  59   6  80  85  41  74  15  81  71
2    5  29  23  51  74  47  74   1  64  26
3   28  22  95  26  44  79  62  17  35  31
4   30  15  86  27  82  40  94  11  87  20

In [341]:
ran_df

     0   1   2   3   4   5   6   7   8   9
0  100  44   4  20  83  84  23   3  34  45
1   25  59   6  80  85  41  74  15  81  71
2    5  29  23  51  74  47  74   1  64  26
3   28  22  95  26  44  79  62  17  35  31
4   30  15  86  27  82  40  94  11  87  20

In [342]:
ran_df.loc[0, 0] = 1000

In [343]:
ran_df.head(2)

      0   1  2   3   4   5   6   7   8   9
0  1000  44  4  20  83  84  23   3  34  45
1    25  59  6  80  85  41  74  15  81  71

In [344]:
ran_df.columns = list('ABCDEFGHIJ')

In [345]:
ran_df.head(2)

      A   B  C   D   E   F   G   H   I   J
0  1000  44  4  20  83  84  23   3  34  45
1    25  59  6  80  85  41  74  15  81  71

In [346]:
ran_df.loc[0,0] = 5000

In [347]:
ran_df.head()

      A   B   C   D   E   F   G   H   I   J       0
0  1000  44   4  20  83  84  23   3  34  45  5000.0
1    25  59   6  80  85  41  74  15  81  71     NaN
2     5  29  23  51  74  47  74   1  64  26     NaN
3    28  22  95  26  44  79  62  17  35  31     NaN
4    30  15  86  27  82  40  94  11  87  20     NaN

In [348]:
ran_df.loc[0,'A'] = 2000

In [349]:
ran_df.head(2)

      A   B  C   D   E   F   G   H   I   J       0
0  2000  44  4  20  83  84  23   3  34  45  5000.0
1    25  59  6  80  85  41  74  15  81  71     NaN

In [350]:
ran_df.drop(0)

    A   B   C   D   E   F   G   H   I   J   0
1  25  59   6  80  85  41  74  15  81  71 NaN
2   5  29  23  51  74  47  74   1  64  26 NaN
3  28  22  95  26  44  79  62  17  35  31 NaN
4  30  15  86  27  82  40  94  11  87  20 NaN

In [351]:
ran_df =  ran_df.drop(0, axis=1)

In [352]:
ran_df

      A   B   C   D   E   F   G   H   I   J
0  2000  44   4  20  83  84  23   3  34  45
1    25  59   6  80  85  41  74  15  81  71
2     5  29  23  51  74  47  74   1  64  26
3    28  22  95  26  44  79  62  17  35  31
4    30  15  86  27  82  40  94  11  87  20

In [353]:
ran_df.loc[[2,3,4], ['E','F','G','H']]

    E   F   G   H
2  74  47  74   1
3  44  79  62  17
4  82  40  94  11

In [354]:
ran_df.loc[:, ['E','F','G','H']]

    E   F   G   H
0  83  84  23   3
1  85  41  74  15
2  74  47  74   1
3  44  79  62  17
4  82  40  94  11

In [355]:
ran_df.loc[[2,3,4], :]

    A   B   C   D   E   F   G   H   I   J
2   5  29  23  51  74  47  74   1  64  26
3  28  22  95  26  44  79  62  17  35  31
4  30  15  86  27  82  40  94  11  87  20

In [356]:
ran_df.loc[(ran_df['A']<70) & (ran_df['B']<50)]

    A   B   C   D   E   F   G   H   I   J
2   5  29  23  51  74  47  74   1  64  26
3  28  22  95  26  44  79  62  17  35  31
4  30  15  86  27  82  40  94  11  87  20

In [357]:
ran_df

      A   B   C   D   E   F   G   H   I   J
0  2000  44   4  20  83  84  23   3  34  45
1    25  59   6  80  85  41  74  15  81  71
2     5  29  23  51  74  47  74   1  64  26
3    28  22  95  26  44  79  62  17  35  31
4    30  15  86  27  82  40  94  11  87  20

In [358]:
ran_df.iloc[0,8]

34

In [359]:
ran_df.iloc[[1,2], [0,1,2]]

    A   B   C
1  25  59   6
2   5  29  23

In [360]:
ran_df.drop(0, axis=0)

    A   B   C   D   E   F   G   H   I   J
1  25  59   6  80  85  41  74  15  81  71
2   5  29  23  51  74  47  74   1  64  26
3  28  22  95  26  44  79  62  17  35  31
4  30  15  86  27  82  40  94  11  87  20

In [361]:
ran_df.drop('J', axis=1)

      A   B   C   D   E   F   G   H   I
0  2000  44   4  20  83  84  23   3  34
1    25  59   6  80  85  41  74  15  81
2     5  29  23  51  74  47  74   1  64
3    28  22  95  26  44  79  62  17  35
4    30  15  86  27  82  40  94  11  87

In [362]:
ran_df

      A   B   C   D   E   F   G   H   I   J
0  2000  44   4  20  83  84  23   3  34  45
1    25  59   6  80  85  41  74  15  81  71
2     5  29  23  51  74  47  74   1  64  26
3    28  22  95  26  44  79  62  17  35  31
4    30  15  86  27  82  40  94  11  87  20

In [363]:
ran_df.drop(['I','J'], axis=1, inplace=True)

In [364]:
ran_df

      A   B   C   D   E   F   G   H
0  2000  44   4  20  83  84  23   3
1    25  59   6  80  85  41  74  15
2     5  29  23  51  74  47  74   1
3    28  22  95  26  44  79  62  17
4    30  15  86  27  82  40  94  11

In [365]:
ran_df.drop([3], axis=0, inplace=True)

In [366]:
ran_df

      A   B   C   D   E   F   G   H
0  2000  44   4  20  83  84  23   3
1    25  59   6  80  85  41  74  15
2     5  29  23  51  74  47  74   1
4    30  15  86  27  82  40  94  11

In [367]:
ran_df.reset_index()

   index     A   B   C   D   E   F   G   H
0      0  2000  44   4  20  83  84  23   3
1      1    25  59   6  80  85  41  74  15
2      2     5  29  23  51  74  47  74   1
3      4    30  15  86  27  82  40  94  11

In [368]:
ran_df.reset_index(drop=True, inplace=True)

In [369]:
ran_df

      A   B   C   D   E   F   G   H
0  2000  44   4  20  83  84  23   3
1    25  59   6  80  85  41  74  15
2     5  29  23  51  74  47  74   1
3    30  15  86  27  82  40  94  11

In [370]:
ran_df.isnull()

       A      B      C      D      E      F      G      H
0  False  False  False  False  False  False  False  False
1  False  False  False  False  False  False  False  False
2  False  False  False  False  False  False  False  False
3  False  False  False  False  False  False  False  False

In [371]:
ran_df.isnull().sum()

A    0
B    0
C    0
D    0
E    0
F    0
G    0
H    0
dtype: int64

In [372]:
ran_df.shape

(4, 8)

In [373]:
ran_df

      A   B   C   D   E   F   G   H
0  2000  44   4  20  83  84  23   3
1    25  59   6  80  85  41  74  15
2     5  29  23  51  74  47  74   1
3    30  15  86  27  82  40  94  11

In [374]:
new_ = pd.Series(np.zeros(5))

In [375]:
new_

0    0.0
1    0.0
2    0.0
3    0.0
4    0.0
dtype: float64

In [376]:

ran_df['K'] = new_

In [377]:
ran_df

      A   B   C   D   E   F   G   H    K
0  2000  44   4  20  83  84  23   3  0.0
1    25  59   6  80  85  41  74  15  0.0
2     5  29  23  51  74  47  74   1  0.0
3    30  15  86  27  82  40  94  11  0.0

In [378]:
type(ran_df)

pandas.core.frame.DataFrame

In [379]:
ran_df

      A   B   C   D   E   F   G   H    K
0  2000  44   4  20  83  84  23   3  0.0
1    25  59   6  80  85  41  74  15  0.0
2     5  29  23  51  74  47  74   1  0.0
3    30  15  86  27  82  40  94  11  0.0

In [380]:
ran_df.isnull()

       A      B      C      D      E      F      G      H      K
0  False  False  False  False  False  False  False  False  False
1  False  False  False  False  False  False  False  False  False
2  False  False  False  False  False  False  False  False  False
3  False  False  False  False  False  False  False  False  False

In [381]:
ran_df

      A   B   C   D   E   F   G   H    K
0  2000  44   4  20  83  84  23   3  0.0
1    25  59   6  80  85  41  74  15  0.0
2     5  29  23  51  74  47  74   1  0.0
3    30  15  86  27  82  40  94  11  0.0

In [382]:
ran_df['H'] = None

In [383]:
ran_df.loc[: , 'H'] = None

In [384]:
ran_df

      A   B   C   D   E   F   G     H    K
0  2000  44   4  20  83  84  23  None  0.0
1    25  59   6  80  85  41  74  None  0.0
2     5  29  23  51  74  47  74  None  0.0
3    30  15  86  27  82  40  94  None  0.0

In [385]:
ran_df.isnull()

       A      B      C      D      E      F      G     H      K
0  False  False  False  False  False  False  False  True  False
1  False  False  False  False  False  False  False  True  False
2  False  False  False  False  False  False  False  True  False
3  False  False  False  False  False  False  False  True  False

In [386]:
ran_df['H'].isnull()

0    True
1    True
2    True
3    True
Name: H, dtype: bool

In [390]:
ran_df.dropna(how='all', axis=1)

      A   B   C   D   E   F   G    K
0  2000  44   4  20  83  84  23  0.0
1    25  59   6  80  85  41  74  0.0
2     5  29  23  51  74  47  74  0.0
3    30  15  86  27  82  40  94  0.0

In [391]:
ran_df

      A   B   C   D   E   F   G     H    K
0  2000  44   4  20  83  84  23  None  0.0
1    25  59   6  80  85  41  74  None  0.0
2     5  29  23  51  74  47  74  None  0.0
3    30  15  86  27  82  40  94  None  0.0

In [402]:
new__df = pd.DataFrame({
    'A': [1, 2, 3, np.nan, 5, 6, 7, pd.NaT, 9, 10],
    'B': [np.nan, 2, 3, 4, 5, 6, 7, 8, 9, pd.NaT],
    'C': [1, 2, 3, 4, np.nan, 6, 7, 8, 9, 10]

})

In [403]:
print(new__df)

     A    B     C
0    1  NaN   1.0
1    2    2   2.0
2    3    3   3.0
3  NaN    4   4.0
4    5    5   NaN
5    6    6   6.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0

In [404]:
new__df.dropna()

   A  B    C
1  2  2  2.0
2  3  3  3.0
5  6  6  6.0
6  7  7  7.0
8  9  9  9.0

In [407]:
new__df.dropna(how='all', axis=1)

     A    B     C
0    1  NaN   1.0
1    2    2   2.0
2    3    3   3.0
3  NaN    4   4.0
4    5    5   NaN
5    6    6   6.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0

In [408]:
new__df.drop_duplicates()

     A    B     C
0    1  NaN   1.0
1    2    2   2.0
2    3    3   3.0
3  NaN    4   4.0
4    5    5   NaN
5    6    6   6.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0

In [411]:
new__df.drop_duplicates(subset='A')

     A    B     C
0    1  NaN   1.0
1    2    2   2.0
2    3    3   3.0
3  NaN    4   4.0
4    5    5   NaN
5    6    6   6.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0

In [412]:
du_df = new__df.copy()

In [417]:
du_df.loc[[1,2,4,5], 'A'] = 1

In [418]:
du_df

     A    B     C
0    1  NaN   1.0
1    1    2   2.0
2    1    3   3.0
3  NaN    4   4.0
4    1    5   NaN
5    1    6   6.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0

In [419]:
du_df.drop_duplicates(subset='A')

     A    B     C
0    1  NaN   1.0
3  NaN    4   4.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0

In [420]:
du_df.drop_duplicates(subset='A', keep='last')

     A    B     C
3  NaN    4   4.0
5    1    6   6.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0

In [422]:
du_df.drop_duplicates(subset='A', keep=False)

     A    B     C
3  NaN    4   4.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0

In [423]:
du_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       8 non-null      object
 1   B       8 non-null      object
 2   C       9 non-null      float64
dtypes: float64(1), object(2)
memory usage: 372.0+ bytes

In [424]:
du_df.info

<bound method DataFrame.info of      A    B     C
0    1  NaN   1.0
1    1    2   2.0
2    1    3   3.0
3  NaN    4   4.0
4    1    5   NaN
5    1    6   6.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0>

In [429]:
du_df

     A    B     C
0    1  NaN   1.0
1    1    2   2.0
2    1    3   3.0
3  NaN    4   4.0
4    1    5   NaN
5    1    6   6.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0

In [432]:
du_df['A'].unique()

array([1, nan, 7, NaT, 9, 10], dtype=object)

In [431]:
du_df['A'].value_counts()

A
1     5
7     1
9     1
10    1
Name: count, dtype: int64

In [434]:
du_df.notnull()

       A      B      C
0   True  False   True
1   True   True   True
2   True   True   True
3  False   True   True
4   True   True  False
5   True   True   True
6   True   True   True
7  False   True   True
8   True   True   True
9   True  False   True

In [435]:
du_df.isnull()

       A      B      C
0  False   True  False
1  False  False  False
2  False  False  False
3   True  False  False
4  False  False   True
5  False  False  False
6  False  False  False
7   True  False  False
8  False  False  False
9  False   True  False

In [438]:
ran_df.corr()

,A,B,C,D,E,F,G,H,K
A,1.000000,0.254813,-0.441592,-0.603061,0.285419,0.987328,-0.948201,NaN,NaN
B,0.254813,1.000000,-0.861399,0.609987,0.494456,0.241204,-0.465892,NaN,NaN
C,-0.441592,-0.861399,1.000000,-0.396247,-0.077159,-0.499411,0.696678,NaN,NaN
D,-0.603061,0.609987,-0.396247,1.000000,0.076291,-0.586086,0.364242,NaN,NaN
E,0.285419,0.494456,-0.077159,0.076291,1.000000,0.141999,-0.186531,NaN,NaN
F,0.987328,0.241204,-0.499411,-0.586086,0.141999,1.000000,-0.968065,NaN,NaN
G,-0.948201,-0.465892,0.696678,0.364242,-0.186531,-0.968065,1.000000,NaN,NaN
H,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
K,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN